//#include<stdio.h>
//#include<conio.h>
//#include<stdlib.h>
//#include<time.h>
//#include<windows.h>
//
//#define LEFT 75
//#define RIGHT 77
//#define UP 72
//#define DOWN 80
//#define SPACE 32
//#define P 80
//#define p 112
//#define ESC 27
//
//#define MAP_HEIGHT 22
//#define MAP_WIDTH 12
//
//#define GAME_SPEED 200;
//#define DRAW_EMPTY 1;
//#define DRAW_WALL 2;
//#define DRAW_BLOCK 3;
//
//char Map[MAP_WIDTH][MAP_HEIGHT];
//
//int Block[][4][4] = {
//	/* 첫번째 블록
//	■
//	■■■	*/
//	{	{0,0,0,0},	{1,0,0,0},	{1,1,1,0},	{0,0,0,0}},
//	{	{0,0,1,0},	{0,0,1,0},	{0,1,1,0},	{0,0,0,0}},
//	{	{1,1,1,0},	{0,0,1,0},	{0,0,0,0},	{0,0,0,0}},
//	{	{1,1,0,0},	{1,0,0,0},	{1,0,0,0},	{0,0,0,0}},
//	/* 두번째블록
//		■
//	■■■    */
//	{	{0,0,0,0},	{0,0,1,0},	{1,1,1,0},	{0,0,0,0}},
//	{	{0,1,1,0},	{0,0,1,0},	{0,0,1,0},	{0,0,0,0}},
//	{	{1,1,1,0},	{1,0,0,0},	{0,0,0,0},	{0,0,0,0}},
//	{	{1,0,0,0},	{1,0,0,0},	{1,1,0,0},	{0,0,0,0}},
//	/* 세번째블록
//	  ■
//	■■■   */
//	{	{0,0,0,0},	{0,1,0,0},	{1,1,1,0},	{0,0,0,0}},
//	{	{0,0,0,0},	{0,1,0,0},	{1,1,0,0},	{0,1,0,0}},
//	{	{0,0,0,0},	{0,0,0,0},	{1,1,1,0},	{0,1,0,0}},
//	{	{0,0,0,0},	{0,1,0,0},	{0,1,1,0},	{0,1,0,0}},
//	/* 네번째블록
//	■■■■  */
//	{	{0,1,0,0},	{0,1,0,0},	{0,1,0,0},	{0,1,0,0}},
//	{	{0,0,0,0},	{0,0,0,0},	{1,1,1,1},	{0,0,0,0}},
//	{	{0,1,0,0},	{0,1,0,0},	{0,1,0,0},	{0,1,0,0}},
//	{	{0,0,0,0},	{0,0,0,0},	{1,1,1,1},	{0,0,0,0}},
//	/* 다섯번째블록
//	■■
//	■■     */
//	{	{1,1,0,0},	{1,1,0,0},	{0,0,0,0},	{0,0,0,0}},
//	{	{1,1,0,0},	{1,1,0,0},	{0,0,0,0},	{0,0,0,0}},
//	{	{1,1,0,0},	{1,1,0,0},	{0,0,0,0},	{0,0,0,0}},
//	{	{1,1,0,0},	{1,1,0,0},	{0,0,0,0},	{0,0,0,0}},
//	/* 여섯번째블록
//	  ■■
//	■■     */
//	{	{0,0,0,0},	{0,1,1,0},	{1,1,0,0},	{0,0,0,0}},
//	{	{0,1,0,0},	{0,1,1,0},	{0,0,1,0},	{0,0,0,0}},
//	{	{0,0,0,0},	{0,1,1,0},	{1,1,0,0},	{0,0,0,0}},
//	{	{0,1,0,0},	{0,1,1,0},	{0,0,1,0},	{0,0,0,0}},
//	/* 일곱번째블록
//	■■
//	  ■■   */
//	{	{0,0,0,0},	{1,1,0,0},	{0,1,1,0},	{0,0,0,0}},
//	{	{0,0,1,0},	{0,1,1,0},	{0,1,0,0},	{0,0,0,0}},
//	{	{0,0,0,0},	{1,1,0,0},	{0,1,1,0},	{0,0,0,0}},
//	{	{0,0,1,0},	{0,1,1,0},	{0,1,0,0},	{0,0,0,0}},
//};
//
//void Block_Controll() {
//	char key;
//	if (_kbhit){
//		key = _getch();
//		if (key == 224) {
//			switch (key) {
//			case LEFT: {}break;
//			case RIGHT: {}break;
//			case UP: {}break;
//			case DOWN: {}break;
//			default : break;
//			}
//		}
//		else {
//			switch (key) {
//			case SPACE: {}break;
//			}
//		}
//	}
//}
//
//void InitMap() {
//	int i, j;
//
//	for (i = 0; i < MAP_WIDTH; i++) {
//		for (j = 0; j < MAP_HEIGHT; j++) {
//			if (i == 0 || i == MAP_WIDTH-1 || j == 0 || j == MAP_HEIGHT-1 ) {
//				Map[i][j] = DRAW_WALL;
//			}
//			else {
//				Map[i][j] = DRAW_EMPTY;
//			}
//		}
//	}
//}
//
//void DrawMap() {
//	int i, j;
//	for (j = 0; j < MAP_HEIGHT; j++) {
//		for (i = 0; i < MAP_WIDTH; i++) {
//			switch (Map[i][j])
//			{
//			case 1 : printf("  "); break;
//			case 2 : printf("▣"); break;
//			case 3 : printf("★"); break;
//			}
//			//printf("%d", Map[i][j]);
//		}
//		puts("");
//	}
//} //맵출력
//
//void SetCurPos(int x, int y) {
//	COORD pos;
//	pos.X = x * 2;
//	pos.Y = y;
//	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
//}
//
//int main() {
//
//	InitMap();
//	DrawMap();
//	//while (1) {
//		//맵출력
//		//블록 생성
//		//블록 출력
//		//키입력 및 동작
//		//충돌판정
//		//화면 클리어
//	//}
//	getchar();
//	getchar();
//	return 0;
//}