//절차지향 : 데이터와 데이터를 조작하는 코드를 별도로 분리 -> 프로시저의 형태로 만든다.
//			각 프로시저들이 데이터를 조작하는 방식으로 코드를 작성할수있다.
//			프로시저는 다른 프로시저를 사용할수도있고 각각의 프로시저가 같은 데이터를 사용할수도있다.
//			이렇게 프로시저로 프로그램을 구성하는 기법을 절차지향 프로그래밍이라 부른다.

//문제점 : 데이터타입이나 의미를 변경해야할때, 함께 수정해야 하는 프로시저가 증가한다.
//			같은 데이터를 프로시저들이 서로다른 의미로 사용하는 경우가 발생

//객체지향 : 절차지향과 달리 객체지향ㅇ은 데이터 및 데이터와 관련된 프로시저를 객체라는 단위로 묶는다.
//			객체는 프로시저를 실행하는데 필요한 만큼의 데이터를 가지며, 객체들이 모여 프로그램을 구성한다.
//			각 객체는 자신만의 데이터와 프로시저를 갖는다. 자신만의 기능을 제공, 다른객체가 제공하는 기능도 사용할수있다.
//			자신에 속한 데이터에만 접근이 가능하고 다른객체에 속한 데이터는 접근이 불가하다.